
===========================================================================
report_tns
============================================================================
tns -410.46

===========================================================================
report_wns
============================================================================
wns -10.00

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.00

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.07
