
===========================================================================
report_tns
============================================================================
tns -93.88

===========================================================================
report_wns
============================================================================
wns -3.73

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.73

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.20
