
===========================================================================
report_tns
============================================================================
tns -418.88

===========================================================================
report_wns
============================================================================
wns -10.16

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.16

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.07
