###############################################################################
# Created by write_sdc
# Sat May 23 04:05:11 2026
###############################################################################
current_design top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 4.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tready}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[0]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[10]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[11]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[12]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[13]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[14]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[15]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[16]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[17]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[18]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[19]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[1]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[20]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[21]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[22]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[23]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[2]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[3]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[4]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[5]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[6]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[7]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[8]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tdata[9]}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tlast}]
set_input_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tvalid}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[0]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[10]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[11]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[12]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[13]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[14]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[15]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[16]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[17]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[18]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[19]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[1]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[20]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[21]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[22]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[23]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[24]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[25]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[26]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[27]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[28]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[29]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[2]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[30]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[31]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[3]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[4]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[5]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[6]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[7]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[8]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tdata[9]}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {m_tvalid}]
set_output_delay 0.8000 -clock [get_clocks {clk}] -add_delay [get_ports {s_tready}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {m_tvalid}]
set_load -pin_load 0.0334 [get_ports {s_tready}]
set_load -pin_load 0.0334 [get_ports {m_tdata[31]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[30]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[29]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[28]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[27]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[26]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[25]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[24]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[23]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[22]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[21]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[20]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[19]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[18]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[17]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[16]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[15]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[14]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[13]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[12]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[11]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[10]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[9]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[8]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[7]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[6]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[5]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[4]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[3]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[2]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[1]}]
set_load -pin_load 0.0334 [get_ports {m_tdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {m_tready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tlast}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tvalid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_tdata[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
