
===========================================================================
report_tns
============================================================================
tns -73.64

===========================================================================
report_wns
============================================================================
wns -3.36

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.36

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.19
