
===========================================================================
report_tns
============================================================================
tns -501.00

===========================================================================
report_wns
============================================================================
wns -10.20

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.20

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.00
