
===========================================================================
report_tns
============================================================================
tns -403.36

===========================================================================
report_wns
============================================================================
wns -9.87

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -9.87

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.09
