
===========================================================================
report_tns
============================================================================
tns -133.80

===========================================================================
report_wns
============================================================================
wns -4.51

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.51

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.21
