
===========================================================================
report_tns
============================================================================
tns -113.14

===========================================================================
report_wns
============================================================================
wns -4.27

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.27

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.21
