
===========================================================================
report_tns
============================================================================
tns -101.77

===========================================================================
report_wns
============================================================================
wns -3.82

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.82

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.21
