
===========================================================================
report_tns
============================================================================
tns -492.77

===========================================================================
report_wns
============================================================================
wns -10.06

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.06

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.02
