
===========================================================================
report_tns
============================================================================
tns -104.46

===========================================================================
report_wns
============================================================================
wns -3.46

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.46

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.30
