
===========================================================================
report_tns
============================================================================
tns -78.59

===========================================================================
report_wns
============================================================================
wns -3.11

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.11

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.27
