
===========================================================================
report_tns
============================================================================
tns -85.20

===========================================================================
report_wns
============================================================================
wns -3.28

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.28

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.30
