
===========================================================================
report_tns
============================================================================
tns -82.68

===========================================================================
report_wns
============================================================================
wns -3.16

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.16

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.30
