
===========================================================================
report_tns
============================================================================
tns -60.81

===========================================================================
report_wns
============================================================================
wns -2.74

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.74

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.27
