
===========================================================================
report_tns
============================================================================
tns -509.94

===========================================================================
report_wns
============================================================================
wns -10.35

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.35

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.01
